In [1]:
import pandas as pd

In [38]:
df_city = pd.read_csv(
    './data/location_ref/city_multilingu_citycoord_countrycode_countrycoord.csv',
    index_col=0)

df_city.head()

,language,CITY_NAME,city_lat_3857,city_long_3857,city_lat_long_3857,population,COUNTRY_ALPHA2_CODE,country_lat_3857,country_long_3857,country_lat_long_3857
0,pl,nowy jork,40.67,-73.94,"40.67, -73.94",8398748.0,US,39.828175,-98.5795,"39.828175,-98.5795"
1,en,new york city,40.67,-73.94,"40.67, -73.94",8398748.0,US,39.828175,-98.5795,"39.828175,-98.5795"
2,fi,new york,40.67,-73.94,"40.67, -73.94",8398748.0,US,39.828175,-98.5795,"39.828175,-98.5795"
3,he,ניו יורק,40.67,-73.94,"40.67, -73.94",8398748.0,US,39.828175,-98.5795,"39.828175,-98.5795"
4,ru,нью-йорк,40.67,-73.94,"40.67, -73.94",8398748.0,US,39.828175,-98.5795,"39.828175,-98.5795"

In [62]:
# check number of cities
df_city['city_lat_long_3857'].nunique()

1460

In [64]:
df_city.loc[df_city['CITY_NAME'] == 'berlin'] # not listed in english or swedish

,language,CITY_NAME,city_lat_3857,city_long_3857,city_lat_long_3857,population,COUNTRY_ALPHA2_CODE,country_lat_3857,country_long_3857,country_lat_long_3857
31553,qu,berlin,52.516667,13.383333,"52.516666666, 13.383333333",3644826.0,DE,51.0,10.0,"51.0,10.0"
31616,jbo,berlin,52.516667,13.383333,"52.516666666, 13.383333333",3644826.0,DE,51.0,10.0,"51.0,10.0"

In [40]:
df_city.shape

(52860, 10)

In [70]:
# get swedish citynames table
df_city_en = df_city[df_city['language'] == 'es']
df_city_en = df_city_en[['CITY_NAME', 'city_lat_long_3857']]
df_city_en.shape

(179, 2)

In [63]:
# get english citynames table
df_city_en = df_city[df_city['language'] == 'en']
df_city_en = df_city_en[['CITY_NAME', 'city_lat_long_3857']]
df_city_en.shape

(146, 2)

In [55]:
df_city_en = df_city_en.reset_index(drop=True)

In [71]:
df_city_en.tail()

        CITY_NAME            city_lat_long_3857
51308     sarátov            51.533333333, 46.0
51346   oremburgo            51.766666666, 55.1
51840     barnaúl    53.356666666, 83.787222222
51921    ulán-udé   51.827222222, 107.606388888
52382  roodepoort             -26.1625, 27.8725

In [57]:
# test
df_city_en.loc[df_city_en['CITY_NAME'] == 'new york city']['CITY_NAME'].values[0]

'new york city'

In [58]:
df_city_en.to_csv('./data/location_ref/citycoords_citynames_en.csv')